core/app/Http/Controllers/Admin/AdminController.php

select * from `new_bed_types` where `accommodation_id` = 1
select * from `room_keys` where `room_keys`.`bed_type_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25)
select * from `rooms` where `rooms`.`bed_type_id` in (1)
select count(*) as aggregate from `bookings` where exists (select * from `booked_rooms` where `bookings`.`id` = `booked_rooms`.`booking_id` and exists (select * from `rooms` where `booked_rooms`.`room_id` = `rooms`.`id` and `accommodation_id` = 1))
---
    public function dashboard() {

        $pageTitle                          = 'Dashboard';
        // $todaysBookedRoomIds                = BookedRoom::active()->where('booked_for', todaysDate())->pluck('room_id')->toArray();
        $todaysBookedRoomIds                = BookedRoom::active()->when(auth()->guard('admin')->user()->accommodation_id,function($q){
                $q->whereHas('room',function($qry){
                    $qry->where('accommodation_id',auth()->guard('admin')->user()->accommodation_id);
                });
            })->pluck('room_id')->toArray();
        $widget['occupiedBedsId']           = Room::active()->whereIn('id',$todaysBookedRoomIds)->when(auth()->guard('admin')->user()->accommodation_id,function($q){
            $q->where('accommodation_id',auth()->guard('admin')->user()->accommodation_id);
        })->count();
        $widget['newbedtypes']           = NewBedType::with('beds','beds.roomKey')->when(auth()->guard('admin')->user()->accommodation_id,function($q){
            $q->where('accommodation_id',auth()->guard('admin')->user()->accommodation_id);
        })->get();

        // $widget['today_booked']             = count($todaysBookedRoomIds);
        $widget['today_booked']             = $widget['occupiedBedsId'];

        $widget['today_available']          = Room::active()->whereNotIn('id', $todaysBookedRoomIds)->when(auth()->guard('admin')->user()->accommodation_id,function($q){
            $q->where('accommodation_id',auth()->guard('admin')->user()->accommodation_id);
        })->count();
        $widget['total']                    = Booking::when(auth()->guard('admin')->user()->accommodation_id,function($q){
            $q->whereHas('bookedRooms',function($query){
                $query->whereHas('room',function($qry){
                    $qry->where('accommodation_id',auth()->guard('admin')->user()->accommodation_id);
                });
            });
        })->count();

select count(*) as aggregate from `users` where `accommodation_id` = 1
---
            });
        })->count();

        $widget['total_users']              = User::when(auth()->guard('admin')->user()->accommodation_id,function($q){
            $q->where('accommodation_id',auth()->guard('admin')->user()->accommodation_id);
        })->count();

select count(*) as aggregate from `amenities` where `accommodation_id` = 1
select count(*) as aggregate from `bed_types` where `accommodation_id` = 1
---
            $q->where('accommodation_id',auth()->guard('admin')->user()->accommodation_id);
        })->count();

        $widget['amenities']                = Amenity::when(auth()->guard('admin')->user()->accommodation_id,function($q){
            $q->where('accommodation_id',auth()->guard('admin')->user()->accommodation_id);
        })->count();
        $widget['rooms']                    = BedType::when(auth()->guard('admin')->user()->accommodation_id,function($q){
            $q->where('accommodation_id',auth()->guard('admin')->user()->accommodation_id);
        })->count();

select * from `accommodations` where `accommodations`.`id` in (1)
select * from `bed_types` where `accommodation_id` = 1
---
        //     $q->where('accommodation_id',auth()->guard('admin')->user()->accommodation_id);
        // })->get();

           $rooms = BedType::with(['beds' => function ($query) {
                $query->active();
            }])
            ->when(auth()->guard('admin')->user()->accommodation_id, function ($query) {
                $query->where('accommodation_id', auth()->guard('admin')->user()->accommodation_id);
            })
            ->get();

select * from `accommodations` where `accommodations`.`id` in (1)
select `browser`, `os`, `country` from `user_logins` where `created_at` >= '2024-08-07 12:39:55'
---
        //         }
        // }

        $roomTypesWithCounts = RoomType::withCount('rooms')->with('accommodation')
                    ->join('accommodations', 'room_types.accommodation_id', '=', 'accommodations.id')
                    ->orderBy('room_types.accommodation_id')
                    ->when(auth()->guard('admin')->user()->accommodation_id,function($q){
                            $q->where('accommodation_id',auth()->guard('admin')->user()->accommodation_id);
                        })->get(['room_types.*', 'accommodations.name as accommodation_name']);


        $userLoginData                     = UserLogin::where('created_at', '>=', now()->subDay(30))->get(['browser', 'os', 'country']);

select SUM( CASE WHEN status IN(1,9) THEN fare END) as bookingAmount, DATE_FORMAT(booked_for,'%M-%Y') as months from `booked_rooms` where `booked_for` >= '2023-09-06 12:39:55' and `status` in (1, 9) and exists (select * from `rooms` where `booked_rooms`.`room_id` = `rooms`.`id` and `accommodation_id` = 1) group by `months` order by `created_at` asc
---
        $report['booking_month_amount']  = collect([]);
        $report['booking_cancel_amount'] = collect([]);

        $bookingMonth  = BookedRoom::where('booked_for', '>=', now()->subYear())
            ->whereIn('status', [Status::ROOM_ACTIVE, Status::ROOM_CHECKOUT])
            ->selectRaw("SUM( CASE WHEN status IN(1,9) THEN fare END) as bookingAmount")
            ->selectRaw("DATE_FORMAT(booked_for,'%M-%Y') as months")
            ->orderBy('created_at')
            ->groupBy('months')
            ->when(auth()->guard('admin')->user()->accommodation_id,function($q){
                $q->whereHas('room',function($qry){
                    $qry->where('accommodation_id',auth()->guard('admin')->user()->accommodation_id);
                });
            })
            ->get();

select SUM(amount) as amount, DATE_FORMAT(created_at,'%Y-%m-%d') as date from `payment_logs` where `type` = 'RECEIVED' and `created_at` >= '2024-08-07 12:39:56' group by `date` order by `created_at` asc
---

        $trxReport['date'] = collect([]);

        $plusTrx = PaymentLog::where('type', 'RECEIVED')->where('created_at', '>=', now()->subDays(30))
            ->selectRaw("SUM(amount) as amount, DATE_FORMAT(created_at,'%Y-%m-%d') as date")
            ->orderBy('created_at')
            ->groupBy('date')
            ->get();

select SUM(amount) as amount, DATE_FORMAT(created_at,'%Y-%m-%d') as date from `payment_logs` where `type` = 'RETURNED' and `created_at` >= '2024-08-07 12:39:56' group by `date` order by `created_at` asc
---
            $trxReport['date']->push($trxData->date);
        });

        $minusTrx = PaymentLog::where('type', 'RETURNED')->where('created_at', '>=', now()->subDays(30))
            ->selectRaw("SUM(amount) as amount, DATE_FORMAT(created_at,'%Y-%m-%d') as date")
            ->orderBy('created_at')
            ->groupBy('date')
            ->get();

select * from `accommodations` where `id` = 1
select * from `new_bed_types` where `new_bed_types`.`accommodation_id` in (1)
select * from `users` where `users`.`accommodation_id` in (1)
---
            }
        }

    $accommodations = Accommodation::with('guests','newBedTypes')->when(auth()->guard('admin')->user()->accommodation_id,function($q){
            $q->where('id',auth()->guard('admin')->user()->accommodation_id);
        })->get();

select count(*) as aggregate from `bookings` where `status` = 1 and `checked_in_at` between '2024-09-01' and '2024-09-30' and `accommodation_id` = 4
select count(*) as aggregate from `bookings` where `status` = 9 and `checked_out_at` between '2024-09-01' and '2024-09-30' and `accommodation_id` = 4
select count(*) as aggregate from `bookings` where `status` = 1 and date(`checked_in_at`) = '2024-09-06' and `accommodation_id` = 1
select count(*) as aggregate from `bookings` where `status` = 9 and date(`checked_out_at`) = '2024-09-06'
---
        $endOfMonth = Carbon::now()->endOfMonth()->toDateString();
        $today = Carbon::today()->toDateString();

        $monthlyCheckins = DB::table('bookings')
        ->where('status', 1)
        ->whereBetween('checked_in_at', [$startOfMonth, $endOfMonth])
        ->when(auth()->guard('admin')->user()->accommodation_id,function($q){
                    $q->where('accommodation_id',auth()->guard('admin')->user()->accommodation_id);

            })
        ->count();

         $monthlyCheckouts = DB::table('bookings')
        ->where('status', 9)
        ->whereBetween('checked_out_at', [$startOfMonth, $endOfMonth])
        ->when(auth()->guard('admin')->user()->accommodation_id,function($q){
                    $q->where('accommodation_id',auth()->guard('admin')->user()->accommodation_id);

            })
        ->count();

        $dailyCheckins = DB::table('bookings')
            ->where('status', 1)
            ->whereDate('checked_in_at', $today)
            ->when(auth()->guard('admin')->user()->accommodation_id,function($q){
                    $q->where('accommodation_id',auth()->guard('admin')->user()->accommodation_id);
            })
            ->count();

            $dailyCheckouts = DB::table('bookings')
            ->where('status', 9)
            ->whereDate('checked_out_at', $today)
            ->when(auth()->guard('admin')->user()->accommodation_id,function($q){
                    $q->where('accommodation_id',auth()->guard('admin')->user()->accommodation_id);

            })
            ->count();