core/app/Http/Controllers/Admin/BedTypeController.php

select * from `accommodations` where `status` = 1 and `id` = 3
select * from `room_types`
select * from `room_items`
select * from `accommodations` where `accommodations`.`id` in (1, 2, 3, 4, 5, 6)
select * from `bed_types` where `accommodation_id` = 3 order by `created_at` desc
select * from `room_types` where `room_types`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12)
select `room_items`.*, `room_room_item`.`room_id` as `pivot_room_id`, `room_room_item`.`room_item_id` as `pivot_room_item_id`, `room_room_item`.`created_at` as `pivot_created_at`, `room_room_item`.`updated_at` as `pivot_updated_at` from `room_items` inner join `room_room_item` on `room_items`.`id` = `room_room_item`.`room_item_id` where `room_room_item`.`room_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150)
select * from `accommodations` where `accommodations`.`id` in (4)
select * from `bed_types` where `room_type_id` = '7' order by `created_at` desc
select * from `room_types` where `room_types`.`id` in (7)
select `room_items`.*, `room_room_item`.`room_id` as `pivot_room_id`, `room_room_item`.`room_item_id` as `pivot_room_item_id`, `room_room_item`.`created_at` as `pivot_created_at`, `room_room_item`.`updated_at` as `pivot_updated_at` from `room_items` inner join `room_room_item` on `room_items`.`id` = `room_room_item`.`room_item_id` where `room_room_item`.`room_id` in (76)
---
    public function index() {
        // dd("Here");
        $pageTitle   = "Room List";
        $accommodations = Accommodation::where('status', 1)->when(auth()->guard('admin')->user()->accommodation_id,function($q){
            $q->where('id',auth()->guard('admin')->user()->accommodation_id);
        })->get();
         $roomTypes = RoomType::get();
        $roomItems = RoomItem::get();
        $bedTypes = BedType::with('roomType', 'roomItems','accommodation')->when(auth()->guard('admin')->user()->accommodation_id,function($q){
            $q->where('accommodation_id',auth()->guard('admin')->user()->accommodation_id);
        })->latest()->get();

        if(request()->has('roomType') && request()->has('accommodation')){
            //  $bedTypes = BedType::with('roomType', 'roomItems', 'accommodation')
            //     ->where('accommodation_id', request()->accommodation_id)
            //     ->where('room_type_id', request()->roomType)
            //     ->latest()
            //     ->get();
            $bedTypes = BedType::with('roomType', 'roomItems', 'accommodation')
                    ->when(request()->has('accommodation_id'), function ($query) {
                        $query->where('accommodation_id', request()->accommodation_id);
                    })
                    ->when(request()->has('roomType'), function ($query) {
                        $query->where('room_type_id', request()->roomType);
                    })
                    ->latest()
                    ->get();