core/app/Http/Controllers/Admin/BookRoomController.php

    public function room() {
        $pageTitle = 'Book Room';
        $roomTypes = RoomType::active()->get(['id', 'name']);
        $accommodations = Accommodation::where('status', 1)->when(auth()->guard('admin')->user()->accommodation_id,function($q){
            $q->where('id',auth()->guard('admin')->user()->accommodation_id);
        })->get(['id', 'name']);
---
select `id`, `name` from `accommodations` where `status` = 1 and `id` = 3

                $users->password = Hash::make('12345678');
                $users->username = strtolower(str_replace(' ', '', $request->guest_name) . '@00');
                $users->accommodation_id = $request->accommodation;
                $users->save();
---
insert into `users` (`employee_id`, `car_no`, `firstname`, `email`, `mobile`, `address`, `nationality`, `passport_no`, `gender`, `department`, `designation`, `category`, `company`, `remarks`, `project`, `password`, `username`, `accommodation_id`, `updated_at`, `created_at`) values ('10338', '9298', 'Alaa Alyasi', '', '0595247820', '', 'KSA', '1077453981', 'male', 'NICU', 'Consultant', 'Physician', 'Fakeeh', '', 'Neom Hospital', '$2y$10$hElJN1hmo6xru8j3wj3IGeSMhHHz1TKf9WgN/NmezFlvfshsg3sxu', 'alaaalyasi@00', '2', '2024-09-05 19:20:10', '2024-09-05 19:20:10')

            $data      = [];
            $roomId    = explode('-', $room)[0];
            $bookedFor = explode('-', $room)[1];
            $isBooked  = BookedRoom::where('room_id', $roomId)->where('booked_for', $bookedFor)->exists();
---
select exists(select * from `booked_rooms` where `room_id` = '48' and `booked_for` = '09/04/2024') as `exists`

                return response()->json(['error' => 'Room has been booked']);
            }

            $room = Room::with('room.roomType')->find($roomId);
---
select * from `bed_types` where `bed_types`.`id` in (48)
select * from `room_types` where `room_types`.`id` in (4)
select * from `rooms` where `rooms`.`id` = '48' limit 1

            $bookedRoomData[$key]['booking_id'] = $booking->id;
        }

        BookedRoom::insert($bookedRoomData);

        $checkIn  = BookedRoom::where('booking_id', $booking->id)->min('booked_for');
        $checkout = BookedRoom::where('booking_id', $booking->id)->max('booked_for');

        $booking->check_in = $checkIn;
        $booking->check_out = Carbon::parse($checkout)->addDay()->toDateString();
        $booking->save();
---
insert into `booked_rooms` (`accommodation_id`, `booked_for`, `booking_id`, `cancellation_fee`, `created_at`, `fare`, `room_id`, `room_type_id`, `status`, `tax_charge`, `updated_at`) values (2, '2024-09-04', 590, '0.00000000', '2024-09-05 19:20:10', '', 48, 4, 1, 0, '2024-09-05 19:20:10')
select min(`booked_for`) as aggregate from `booked_rooms` where `booking_id` = 590
select max(`booked_for`) as aggregate from `booked_rooms` where `booking_id` = 590
update `bookings` set `check_in` = '2024-09-04', `check_out` = '2024-09-05', `bookings`.`updated_at` = '2024-09-05 19:20:10' where `id` = 590

    public function bookingCheckout(Request $request){

         $validator = Validator::make($request->all(), [

            'date' => 'required|string',
        ]);

        if ($validator->fails()) {
            return response()->json(['error' => $validator->errors()->all()]);
        }

        $checkout = Booking::find($request->id);

        if($checkout){
            $checkout->check_out = $request->date;
            $checkout->checked_out_at = $request->date;
            $checkout->save();
---
select * from `bookings` where `bookings`.`id` = '589' limit 1
update `bookings` set `check_out` = '2024-09-04', `checked_out_at` = '2024-09-04 00:00:00', `bookings`.`updated_at` = '2024-09-05 19:14:33' where `id` = 589