core/app/Http/Controllers/Admin/BookingController.php

    public function pendingCheckIn() {

        $pageTitle         = 'Pending Check-Ins';
        $bookings   = Booking::active()->keyNotGiven()->whereDate('check_in', '<=', now())->with('user')->withCount('activeBookedRooms as total_room')->when(auth()->guard('admin')->user()->accommodation_id,function($q){
            $q->whereHas('bookedRooms',function($query){
                $query->whereHas('room',function($qry){
                    $qry->where('accommodation_id',auth()->guard('admin')->user()->accommodation_id);
                });
            });
        })->get();
---
select * from `users` where `users`.`id` in (325)

    public function delayedCheckouts() {
        $pageTitle    = 'Delayed Checkouts';
        $bookings     = Booking::with('user')->delayedCheckout()->when(auth()->guard('admin')->user()->accommodation_id,function($q){
            $q->whereHas('bookedRooms',function($query){
                $query->whereHas('room',function($qry){
                    $qry->where('accommodation_id',auth()->guard('admin')->user()->accommodation_id);
                });
            });
        })->get();
---
select * from `users` where `users`.`id` in (3, 4, 5, 8, 10, 11, 14, 15, 21, 25, 26, 27, 28, 29, 30, 34, 35, 36, 38, 39, 40, 42, 43, 44, 45, 46, 47, 48, 49, 50, 52, 53, 57, 58, 59, 60, 61, 62, 63, 65, 66, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 79, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 100, 101, 102, 103, 106, 107, 108, 109, 110, 111, 113, 114, 115, 116, 117, 121, 122, 123, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 167, 168, 169, 170, 171, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 198, 199, 200, 201, 202, 203, 205, 206, 208, 209, 210, 211, 212, 213, 215, 218, 223, 224, 225, 226, 231, 232, 233, 234, 236, 237, 238, 239, 240, 241, 243, 244, 245, 251, 252, 277, 278, 279, 287, 291, 295, 299, 300, 302, 304, 305, 306, 310, 312, 314, 315, 316, 317, 318, 319, 320, 321, 322, 324)

    public function bookingDetails($id) {
        $booking = Booking::with([
            'bookedRooms',
            'activeBookedRooms:id,booking_id,room_id',
            'activeBookedRooms.room:id,room_number',
            'bookedRooms.room:id,room_type_id,room_number',
            'bookedRooms.room.room.roomType:id,name',
            'usedExtraService.room',
            'usedExtraService.extraService',
            'payments'
        ])->findOrFail($id);
---
select * from `bed_types` where 0 = 1
select * from `booked_rooms` where `booked_rooms`.`booking_id` in (590)
select * from `bookings` where `bookings`.`id` = '590' limit 1
select * from `used_extra_services` where `used_extra_services`.`booking_id` in (590)

    protected function bookingData($scope) {
        $query = Booking::query()->with('accommodation')->when(auth()->guard('admin')->user()->accommodation_id,function($q){
            $q->whereHas('bookedRooms',function($query){
                $query->whereHas('room',function($qry){
                    $qry->where('accommodation_id',auth()->guard('admin')->user()->accommodation_id);
                });
            });
        });

        if ($scope != "ALL") {
            $query = $query->$scope();
        }

        $request = request();
        if ($request->search) {
            $search = $request->search;
            $query = $query->where(function ($q) use ($search) {
                $q->where('booking_number', $search)
                    ->orWhere(function ($q) use ($search) {
                        $q->whereHas('user', function ($user) use ($search) {
                            $user->where('username', 'like', "%$search%")
                                ->orWhere('email', 'like', "%$search%");
                        })
                            ->orWhere('guest_details->name', 'like', "%$search%")
                            ->orWhere('guest_details->email', 'like', "%$search%");
                    });
            });
        }

        if ($request->check_in) {
            $query = $query->whereDate('check_in', $request->check_in);
---
select * from `accommodations` where `accommodations`.`id` in (1)

        if ($request->check_out) {
            $query = $query->whereDate('check_out', $request->check_out);
        }
        return $query->with('bookedRooms.room', 'user', 'activeBookedRooms', 'activeBookedRooms.room:id,room_number')
            ->withSum('usedExtraService', 'total_amount')
            ->latest()
            ->orderBy('check_in', 'asc')
            ->get();
---
select * from `booked_rooms` where `booked_rooms`.`booking_id` in (259, 260, 261, 262, 263, 264, 265, 266, 271, 272, 281, 284, 285, 287, 565, 571, 575, 577, 580, 581, 585, 586)
select * from `users` where `users`.`id` in (3, 4, 5, 10, 11, 14, 15, 26, 30, 34, 36, 38, 39, 42, 215, 306, 310, 312, 315, 316, 320, 321)
select `id`, `room_number` from `rooms` where `rooms`.`id` in (3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 20, 21, 22, 23, 24, 25)