core/app/Http/Controllers/Admin/ManageBookingController.php

    public function handoverKey($id) {
        $booking = Booking::active()->findOrFail($id);

        if ($booking->key_status == Status::ENABLE) {
            $notify[] = ['error', 'Keys have already been given to the guest'];
            return back()->withNotify($notify);
        }

        if (now()->format('Y-m-d') < $booking->check_in) {
            $notify[] = ['error', 'You can\'t handover keys before the check-in date'];
            return back()->withNotify($notify);
        }

        // if (now()->format('Y-m-d') >= $booking->check_out) {
        //     $notify[] = ['error', 'You can\'t handover keys after the check-out date'];
        //     return back()->withNotify($notify);
        // }

        $booking->key_status = Status::ENABLE;
        $booking->checked_in_at = now();
        $booking->save();
---
update `bookings` set `key_status` = 1, `checked_in_at` = '2024-09-05 19:21:45', `bookings`.`updated_at` = '2024-09-05 19:21:45' where `id` = 590

    public function checkOutPreview($id) {
        $booking           = Booking::active()->with('bookedRooms', 'payments', 'usedExtraService', 'user')->findOrFail($id);
---
select * from `booked_rooms` where `booked_rooms`.`booking_id` in (589)
select * from `used_extra_services` where `used_extra_services`.`booking_id` in (589)
select * from `users` where `users`.`id` in (324)

    public function checkOut($id) {
        $booking = Booking::active()->with('payments')->withSum('usedExtraService', 'total_amount')->findOrFail($id);

        if ($booking->check_out > now()->toDateString()) {
            $notify[] = ['error', 'Checkout date for this booking is greater than now'];
            return back()->withNotify($notify);
        }

        $due = getAmount($booking->total_amount - $booking->paid_amount);

        if ($due > 0) {
            $notify[] = ['error', 'The guest should pay the payable amount first'];
            return back()->withNotify($notify);
        }

        if ($due < 0) {
            $notify[] = ['error', 'Refund the refundable amount to the guest first'];
            return back()->withNotify($notify);
        }

        $booking->createActionHistory('checked_out');

        $booking->activeBookedRooms()->update(['status' => Status::BOOKING_CHECKOUT]);
---
update `booked_rooms` set `status` = 9, `booked_rooms`.`updated_at` = '2024-09-05 17:37:51' where `booked_rooms`.`booking_id` = 549 and `booked_rooms`.`booking_id` is not null and `status` = 1

                }
            }

        $booking->save();
---
update `bookings` set `status` = 9, `checked_out_at` = '2024-09-05 17:37:51', `sign` = '66d9c23fd81fa1725547071.pdf', `bookings`.`updated_at` = '2024-09-05 17:37:51' where `id` = 549