core/app/Http/Controllers/Admin/ManageUsersController.php

select * from `accommodations` where `accommodations`.`id` in (1)
select * from `users` where `accommodation_id` = 1 order by `id` desc
---
    protected function userData($scope = null) {
        if ($scope) {
            $users = User::$scope();
        } else {
            $users = User::query();
        }
        return $users->with('accommodation')->searchable(['username', 'email'])->orderBy('id', 'desc')->when(auth()->guard('admin')->user()->accommodation_id,function($q){
            $q->where('accommodation_id',auth()->guard('admin')->user()->accommodation_id);
        })->get();