core/app/Http/Controllers/Admin/ReportController.php

select * from `accommodations` where `accommodations`.`id` in (1)
select * from `booked_rooms` where `booked_rooms`.`booking_id` in (257, 258, 259, 260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 279, 280, 281, 284, 285, 287, 289, 290, 499, 500, 501, 502, 503, 504, 505, 536, 542, 543, 544, 545, 546, 547, 548, 549, 550, 551, 560, 564, 565, 566, 568, 571, 574, 575, 577, 580, 581, 585, 586)
---
    protected function bookingData($scope) {
        $query = Booking::query()->with('accommodation')->when(auth()->guard('admin')->user()->accommodation_id,function($q){
            $q->whereHas('bookedRooms',function($query){
                $query->whereHas('room',function($qry){
                    $qry->where('accommodation_id',auth()->guard('admin')->user()->accommodation_id);
                });
            });
        });

        if ($scope != "ALL") {
            $query = $query->$scope();
        }

        $request = request();

        if ($request->search) {
            $search = $request->search;
            $query = $query->where(function ($q) use ($search) {
                $q->where('booking_number', $search)
                    ->orWhere(function ($q) use ($search) {
                        $q->whereHas('user', function ($user) use ($search) {
                            $user->where('username', 'like', "%$search%")
                                ->orWhere('email', 'like', "%$search%");
                        })
                            ->orWhere('guest_details->name', 'like', "%$search%")
                            ->orWhere('guest_details->email', 'like', "%$search%");
                    });
            });

select * from `users` where `users`.`id` in (1, 2, 3, 4, 5, 7, 10, 11, 14, 15, 18, 20, 22, 24, 26, 30, 31, 32, 34, 36, 38, 39, 41, 42, 214, 215, 216, 217, 221, 222, 255, 256, 276, 280, 281, 282, 283, 284, 285, 286, 287, 288, 289, 298, 303, 306, 309, 310, 312, 315, 316, 320, 321)
select `id`, `room_number` from `rooms` where `rooms`.`id` in (3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 20, 21, 22, 23, 24, 25)
---
            $query = $query->whereDate('check_out', $request->check_out);
        }

        return $query->with('bookedRooms.room', 'user', 'activeBookedRooms', 'activeBookedRooms.room:id,room_number')
            ->withSum('usedExtraService', 'total_amount')
            ->latest()
            ->orderBy('check_in', 'asc')
            ->get();