core/app/Http/Controllers/Admin/RoomTypeController.php

    public function getroomType($accommodation_id){
         $data['roomtypes'] = RoomType::where('accommodation_id', $accommodation_id)->get();
         $data['bedtypes'] = NewBedType::where('accommodation_id', $accommodation_id)->get();
---
select * from `room_types` where `accommodation_id` = '2'
select * from `new_bed_types` where `accommodation_id` = '2'