core/app/Http/Controllers/Admin/RoomController.php

    public function index() {
        $pageTitle = 'All Beds';
        $roomTypes = RoomType::get();
        $roomItems = RoomItem::get();
        $accommodations = Accommodation::where('status', 1)->when(auth()->guard('admin')->user()->accommodation_id,function($q){
            $q->where('id',auth()->guard('admin')->user()->accommodation_id);
        })->get();
        $beds = BedType::get();

        $rooms = Room::searchable(['room_number', 'bedType:name'])->filter(['bed_type_id'])->when(auth()->guard('admin')->user()->accommodation_id,function($q){
            $q->where('accommodation_id',auth()->guard('admin')->user()->accommodation_id);
        })->orderBy('room_number');

        // if (request()->has('bedType') && request()->has('accommodation')) {
        //     $rooms->with('bedType', 'roomItems','accommodation')->where('room_type_id', request()->roomType)
        //           ->where('accommodation_id', request()->accommodation);
        // }

        if (request()->status == Status::ENABLE || request()->status == Status::DISABLE) {
            $rooms->filter(['status']);
        }

        $rooms =  $rooms->with('room','roomStatus','bedType','accommodation')->orderBy('room_number', 'asc')->get();
---
select * from `room_types`
select * from `room_items`
select * from `accommodations` where `status` = 1
select * from `bed_types`
select * from `accommodations` where `accommodations`.`id` in (1, 2, 3, 4, 5, 6)
select * from `bed_types` where `bed_types`.`id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150)
select * from `rooms` order by `room_number` asc, `room_number` asc
select * from `statuses` where `statuses`.`room_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 242, 243, 244, 245, 246, 247, 248, 249, 250, 251)

    public function getOccupiedRoom(){
        $pageTitle = 'Occupied Beds';
        // $bookedRooms = BookedRoom::active()->where('booked_for', todaysDate())->pluck('room_id')->toArray();
        $bookedRooms    = BookedRoom::active()->pluck('room_id')->toArray();
        $rooms = Room::with('bedType','accommodation')->whereIn('id', $bookedRooms)->when(auth()->guard('admin')->user()->accommodation_id,function($q){
            $q->where('accommodation_id',auth()->guard('admin')->user()->accommodation_id);
        })->get();
---
select * from `accommodations` where `accommodations`.`id` in (1)
select * from `new_bed_types` where `new_bed_types`.`id` in (1)
select * from `rooms` where `id` in (4, 5, 6, 7, 8, 9, 10, 11, 16, 17, 27, 28, 20, 21, 22, 23, 36, 53, 37, 54, 55, 56, 38, 57, 59, 39, 63, 64, 65, 41, 42, 66, 44, 45, 46, 49, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 85, 86, 88, 90, 91, 92, 95, 97, 98, 103, 104, 105, 106, 153, 107, 108, 154, 111, 112, 113, 155, 155, 157, 114, 158, 117, 118, 119, 120, 159, 123, 124, 160, 125, 161, 126, 127, 162, 128, 163, 129, 130, 164, 133, 165, 135, 166, 167, 137, 168, 138, 169, 139, 170, 140, 142, 143, 144, 171, 146, 172, 147, 148, 174, 149, 175, 176, 150, 177, 203, 178, 179, 180, 204, 181, 182, 183, 205, 207, 185, 208, 186, 209, 210, 189, 211, 190, 212, 191, 184, 216, 217, 193, 218, 195, 219, 196, 220, 221, 222, 197, 223, 198, 224, 199, 225, 200, 226, 227, 228, 229, 233, 234, 235, 236, 237, 238, 239, 240, 244, 245, 246, 247, 248, 249, 250, 251, 29, 94, 116, 47, 62, 61, 141, 230, 32, 50, 242, 243, 25, 30, 121, 122, 13, 14, 3, 43, 18, 24, 99, 40, 33, 15, 12, 35, 48) and `accommodation_id` = 1

        public function getVacantRoom(){
        $pageTitle = 'Vacant Beds';

        // $bookedRooms = BookedRoom::active()->where('booked_for', todaysDate())->pluck('room_id')->toArray();
        $bookedRooms    = BookedRoom::active()->pluck('room_id')->toArray();
        $rooms = Room::with('bedType','accommodation','room')->whereNotIn('id', $bookedRooms)->when(auth()->guard('admin')->user()->accommodation_id,function($q){
            $q->where('accommodation_id',auth()->guard('admin')->user()->accommodation_id);
        })->get();
---
select * from `accommodations` where `accommodations`.`id` in (1)
select * from `new_bed_types` where `new_bed_types`.`id` in (1)
select * from `rooms` where `id` not in (4, 5, 6, 7, 8, 9, 10, 11, 16, 17, 27, 28, 20, 21, 22, 23, 36, 53, 37, 54, 55, 56, 38, 57, 59, 39, 63, 64, 65, 41, 42, 66, 44, 45, 46, 49, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 85, 86, 88, 90, 91, 92, 95, 97, 98, 103, 104, 105, 106, 153, 107, 108, 154, 111, 112, 113, 155, 155, 157, 114, 158, 117, 118, 119, 120, 159, 123, 124, 160, 125, 161, 126, 127, 162, 128, 163, 129, 130, 164, 133, 165, 135, 166, 167, 137, 168, 138, 169, 139, 170, 140, 142, 143, 144, 171, 146, 172, 147, 148, 174, 149, 175, 176, 150, 177, 203, 178, 179, 180, 204, 181, 182, 183, 205, 207, 185, 208, 186, 209, 210, 189, 211, 190, 212, 191, 184, 216, 217, 193, 218, 195, 219, 196, 220, 221, 222, 197, 223, 198, 224, 199, 225, 200, 226, 227, 228, 229, 233, 234, 235, 236, 237, 238, 239, 240, 244, 245, 246, 247, 248, 249, 250, 251, 29, 94, 116, 47, 62, 61, 141, 230, 32, 50, 242, 243, 25, 30, 121, 122, 13, 14, 3, 43, 18, 24, 99, 40, 33, 15, 12, 35, 48) and `accommodation_id` = 1