core/app/Http/Controllers/Admin/StaffController.php

select * from `admins`
select * from `roles` where `roles`.`id` in (0, 1, 3)
select * from `accommodations` where `status` = 1
select * from `roles`
---
    public function index() {
        $pageTitle = 'All Guest';
        $allStaff = Admin::with('role')->get();
        $accommodations = Accommodation::where('status',1)->get();
        $roles = Role::all();