core/app/Models/Booking.php

insert into `booking_action_histories` (`booking_id`, `remark`, `details`, `admin_id`, `updated_at`, `created_at`) values (590, 'book_room', '', 10, '2024-09-05 19:20:10', '2024-09-05 19:20:10')
---
    public function createActionHistory($remark, $details = null) {
        $bookingActionHistory             = new BookingActionHistory();
        $bookingActionHistory->booking_id = $this->id;
        $bookingActionHistory->remark     = $remark;
        $bookingActionHistory->details    = $details;
        $bookingActionHistory->admin_id   = authAdmin()->id;
        $bookingActionHistory->save();