core/app/Traits/BookingActions.php

select * from `bed_types` where `bed_types`.`id` in (52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75)
select `id`, `name`, `fare` from `room_types` where `room_types`.`id` in (6)
---
    private function getRooms(Request $request) {
        $checkIn = Carbon::parse($request->checkin_date);
        $checkOut = $request->checkout_date ? Carbon::parse($request->checkout_date) : $checkIn;
        $rooms = Room::active()
            ->whereHas('room', function($q) use ($request){
                return $q->where('room_type_id', $request->room_type);
            })
            ->whereBedTypeId($request->bed_type_id)
            ->with([
                'booked' => function ($q) {
                    $q->active();
                },
                'room.roomType' => function ($q) {
                    $q->select('id', 'name', 'fare');
                }
            ])
            ->get();