core/app/Http/Helpers/helpers.php

select * from `frontends` where `data_keys` = 'banner.content' order by `id` desc limit 1
---
function getContent($dataKeys, $singleQuery = false, $limit = null, $orderById = false) {
    if ($singleQuery) {
        $content = Frontend::where('data_keys', $dataKeys)->orderBy('id', 'desc')->first();