core/app/Providers/AppServiceProvider.php

    public function boot() {
        $general        = Cache::get('GeneralSetting');
        $general        = gs();
        $activeTemplate = activeTemplate();

        $viewShare['general']            = $general;
        $viewShare['activeTemplate']     = $activeTemplate;
        $viewShare['activeTemplateTrue'] = activeTemplate(true);
        $viewShare['emptyMessage']       = 'No data found';
        $viewShare['bookingRequestCount']       = BookingRequest::initial()->count();

        view()->share($viewShare);

        view()->composer('admin.partials.sidenav', function ($view) {
            $view->with([
                'bannedUsersCount'           => User::banned()->count(),
                'emailUnverifiedUsersCount'  => User::emailUnverified()->count(),
                'mobileUnverifiedUsersCount' => User::mobileUnverified()->count(),
                'pendingTicketCount'         => SupportTicket::whereIN('status', [Status::TICKET_OPEN, Status::TICKET_REPLY])->count(),
                'pendingDepositsCount'       => Deposit::pending()->count(),
                'delayedCheckoutCount'       => Booking::delayedCheckout()->count(),
                'refundableBookingCount'     => Booking::refundable()->count(),
                'pendingCheckInsCount'    => Booking::active()->keyNotGiven()->whereDate('check_in', '<=', now())->count()
            ]);
        });

        view()->composer('admin.partials.topnav', function ($view) {
            $view->with([
                'bookingRequestCount'    => BookingRequest::initial()->count(),
                'adminNotifications'     => AdminNotification::where('is_read', Status::NO)->with('user')->orderBy('id', 'desc')->take(10)->get(),
                'adminNotificationCount' => AdminNotification::where('is_read', Status::NO)->count(),
            ]);
        });
---
select count(*) as aggregate from `bookings` where `status` = 3 and (booking_fare + tax_charge + service_cost + extra_charge + cancellation_fee - extra_charge_subtracted - paid_amount) < 0
select count(*) as aggregate from `users` where `status` = 0
select count(*) as aggregate from `support_tickets` where `status` in (0, 2)
select count(*) as aggregate from `booking_requests` where `status` = 0
select * from `admin_notifications` where `is_read` = 0 order by `id` desc limit 10
select count(*) as aggregate from `admin_notifications` where `is_read` = 0