core/routes/admin.php

Route::middleware('admin', 'adminPermission')->group(function () {

    Route::post('/accommodation-change', function(){
        auth()->guard('admin')->user()->update([
            'accommodation_id' => request()->admin_accommodation_id
        ]);
---
update `admins` set `accommodation_id` = '3', `admins`.`updated_at` = '2024-09-05 12:25:32' where `id` = 1